app/Controllers/Admin.php

    public function index()
    {
        $data =[
            'artikel' => $this->M_Artikel->findAll()

        ];
---
SELECT *
FROM `artikel`

    public function edit($id){ //form tambah
        $artikel=$this->M_Artikel->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '11'