app/Controllers/Home.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $artikel = $this->M_Artikel->findAll();

SELECT *
FROM `artikel`
---
    public function berita()
    {
        $artikel = $this->M_Artikel->findAll();