app/Controllers/Login.php

SELECT *
FROM `akun_admin`
WHERE `user` = 'admin'
 LIMIT 1
---
    public function index()
    {

        $ModelAdmin = new \App\Models\M_akun_admin();
        $login = $this->request->getPost('login');
        if ($login) {
            $user = $this->request->getPost('user');
            $password = $this->request->getPost('password');

            if ($user == '' or $password == '') {
                $err = " Masukan Username dan Password";
            }
            if (empty($err)) {
                $dataAdmin = $ModelAdmin->where("user", $user)->first();